app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    blog_post = BlogPost.all

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_by_id
    blog_post = BlogPost.find_by(id: params[:id])

INSERT INTO "blog_posts" ("title", "content", "created_at", "updated_at", "views", "author") VALUES (?, ?, ?, ?, ?, ?)  [["title", "gergergergerger"], ["content", ""], ["created_at", "2024-06-07 18:13:43.687091"], ["updated_at", "2024-06-07 18:13:43.687091"], ["views", nil], ["author", ""]]
---
  def create
    post = BlogPost.create(post_params)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 1]]
---
  def update
    post = BlogPost.find_by(id: params[:id])

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 1]]
---
  def destroy
    post_id = params[:id]
    post = BlogPost.destroy_by(id: post_id)