app/controllers/comments_controller.rb

  def create
    comment = Comment.create(post_params)
---
INSERT INTO "comments" ("content", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sebu"], ["blog_post_id", 2], ["created_at", "2024-06-18 18:12:13.427882"], ["updated_at", "2024-06-18 18:12:13.427882"]]

  def update
    comment = Comment.find_by(id: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]

  def destroy
    comment = Comment.destroy_by(id: params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]