app/controllers/users_controller.rb

  def destroy
    render json: User.find_by(id:params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def find_by_id
    user = User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]